[
  {
    "id": 1,
    "name": "The Shawshank Redemption",
    "genre": "Drama",
    "rating": 9.3,
    "review": "Andy Dufresne, a successful banker, is convicted and sentenced to two life terms at Shawshank State Penitentiary. Despite the brutality and violence within the prison, including attacks from a predatory group known as, Andy maintains his composure, dignity, and hope. He quickly befriends Ellis Red Redding, a seasoned inmate known for procuring contraband, and through this friendship gains support and crucial items that aid in his long-term plans.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Shawshank Redemption",
    "poster_url": "assets/shawshank.png",
    "short_story": "The Shawshank Redemption begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 2,
    "name": "The Godfather",
    "genre": "Drama",
    "rating": 9.2,
    "review": "The Godfather is celebrated for its masterful storytelling, complex characters, and cinematic achievements, including its pacing, cinematography, and Bernard Herrmann-inspired musical score by Nino Rota. Iconic lines like “I’m gonna make him an offer he can’t refuse” have entered popular culture. It won the Academy Award for Best Picture, and Marlon Brando received Best Actor. Its themes have influenced countless films, television series, and discussions about crime, family, and morality.",
    "reviewer_name": "System",
    "review_date": "2022-01-21",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Godfather",
    "poster_url": "assets/godfather.png",
    "short_story": "The Godfather begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 3,
    "name": "The Dark Knight",
    "genre": "Fiction",
    "rating": 9.1,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2008-05-03",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Dark Knight",
    "poster_url": "assets/dark.png",
    "short_story": "The Dark Knight begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 4,
    "name": "Inception",
    "genre": "Action",
    "rating": 9.5,
    "review": "Inception blends science fiction, psychological thriller, and heist elements to explore dream manipulation, the nature of reality, guilt, and the power of ideas. The layered dream structure challenges the boundaries between subconscious and reality. Emotional depth is central, with Cobb’s unresolved grief over Mal serving as a driving narrative force. Visually, the film combines practical effects and CGI, featuring landmark sequences such as a folding city and zero-gravity fight. The score by Hans Zimmer, including the track “Time,” enhances the emotional intensity and dreamlike atmosphere.",
    "reviewer_name": "System",
    "review_date": "2010-02-12",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Inception",
    "poster_url": "assets/inception.png",
    "short_story": "Inception begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 5,
    "name": "Interstellar",
    "genre": "Drama",
    "rating": 8.7,
    "review": "Set in a dystopian future where Earth faces massive crop failures and dust storms, humanity is on the brink of extinction. Joseph Cooper, a widowed former NASA pilot turned farmer, discovers gravitational anomalies with his daughter Murph, which lead them to a secret NASA facility. NASA reveals a wormhole near Saturn that opens access to a distant galaxy containing potentially habitable planets. Cooper is recruited to pilot the spacecraft Endurance on a mission to save humanity, leaving behind his children as part of Plan B, which aims to resettle with 5,000 frozen human embryos if Earth cannot be saved.",
    "reviewer_name": "System",
    "review_date": "2014-11-14",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Interstellar",
    "poster_url": "assets/inter.png",
    "short_story": "Interstellar begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 6,
    "name": "Fight Club",
    "genre": "Action",
    "rating": 8.0,
    "review": "Fight Club was primarily shot in Los Angeles from July to December 1998. Fincher employed innovative cinematography, visual effects, and narrative techniques to reflect the story’s psychological complexity, including subliminal frames of Tyler before his formal introduction. The soundtrack by The Dust Brothers and Pixies’ “Where Is My Mind?” at the finale enhances the chaotic and subversive tone.",
    "reviewer_name": "System",
    "review_date": "1999-07-21",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Fight Club",
    "poster_url": "assets/fight.png",
    "short_story": "Fight Club begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 7,
    "name": "Forrest Gump",
    "genre": "Action",
    "rating": 8.8,
    "review": "Forrest Gump is a 1994 American drama film directed by Robert Zemeckis. An adaptation of the 1986 novel by Winston Groom, the film's screenplay was written by Eric Roth. It stars Tom Hanks in the title role, alongside Robin Wright, Gary Sinise, Mykelti Williamson, and Sally Field in lead roles. The film follows the life of an Alabama man named Forrest Gump (Hanks) and his experiences in the 20th-century United States. Principal photography took place between August and December 1993, mainly in Georgia, North Carolina, and South Carolina. Extensive visual effects were used to incorporate Hanks into archived footage and to develop other scenes. The soundtrack features songs reflecting the different periods seen in the film. Various interpretations have been made of the protagonist and the film's political symbolism.",
    "reviewer_name": "System",
    "review_date": "1994-10-10",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Forrest Gump",
    "poster_url": "assets/forrest.png",
    "short_story": "Forrest Gump begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 8,
    "name": "Pulp Fiction",
    "genre": "Romance",
    "rating": 8.7,
    "review": "'Pulp Fiction' intertwines several stories of crime and redemption in Los Angeles. The film features a diverse cast of characters, including hitmen Vincent Vega (John Travolta) and Jules Winnfield (Samuel L. Jackson), a boxer named Butch Coolidge (Bruce Willis), and the gangster's wife, Mia Wallace (Uma Thurman). The narrative is non-linear, presenting events out of chronological order, which adds to its unique storytelling style",
    "reviewer_name": "System",
    "review_date": "1994-09-13",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Pulp Fiction",
    "poster_url": "assets/pulp.png",
    "short_story": "Pulp Fiction begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 9,
    "name": "The Matrix",
    "genre": "Drama",
    "rating": 8.0,
    "review": "'The Matrix' is a 1999 science-fiction film directed by the Wachowskis. It stars Keanu Reeves as Neo, Laurence Fishburne as Morpheus, and Carrie-Anne Moss as Trinity. The film's plot explores a dystopian future where humans are unknowingly trapped in a simulated reality called the Matrix, created by sentient machines to subdue humanity while their bodies generate energy. Neo is recruited by Morpheus to understand the truth and ultimately fight for human freedom.",
    "reviewer_name": "System",
    "review_date": "1999-06-12",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Matrix",
    "poster_url": "assets/matrix.png",
    "short_story": "The Matrix begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 10,
    "name": "The Avengers",
    "genre": "Action",
    "rating": 9.4,
    "review": "The Avengers were first introduced in Marvel Comics in 1963, created by Stan Lee and Jack Kirby. The original lineup included Iron Man, Thor, Hulk, Ant-Man, and the Wasp. Their formation was inspired by the idea that combining individual superheroes would allow them to tackle major challenges and villains beyond the capability of any single hero.",
    "reviewer_name": "System",
    "review_date": "2012-06-23",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Avengers",
    "poster_url": "assets/avengers.png",
    "short_story": "The Avengers begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 11,
    "name": "Avengers: Endgame",
    "genre": "Action",
    "rating": 8.8,
    "review": "Avengers: Endgame (2019) follows the aftermath of Thanos’ snap, which wiped out half of all life in the universe. The surviving Avengers—Iron Man, Captain America, Thor, Black Widow, Hulk, and Hawkeye—grapple with grief and guilt while seeking a way to reverse the devastation. The team devises a time heist, traveling to pivotal moments in past MCU films to retrieve the six Infinity Stones before Thanos can use them. Their goal is to restore the lives lost and prevent the destruction caused by the snap.",
    "reviewer_name": "System",
    "review_date": "2020-11-15",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Avengers: Endgame",
    "poster_url": "assets/endgame.png",
    "short_story": "Avengers: Endgame begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 12,
    "name": "Gladiator",
    "genre": "Drama",
    "rating": 8.0,
    "review": "Gladiators were primarily slaves, prisoners of war, or condemned criminals trained to fight in public spectacles, although some volunteered for the profession seeking fame and prize money. Their fights were held in amphitheaters across the Roman Empire, with the Colosseum in Rome being the most famous venue. The term 'gladiator' comes from the Latin word gladius, meaning sword, which reflects the weapon central to their fights.",
    "reviewer_name": "System",
    "review_date": "2019-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Gladiator",
    "poster_url": "assets/glad.png",
    "short_story": "Gladiator begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 13,
    "name": "Titanic",
    "genre": "Romance",
    "rating": 9.4,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "1990-02-14",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Titanic",
    "poster_url": "assets/titanic.png",
    "short_story": "Titanic begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 14,
    "name": "Avatar",
    "genre": "Action",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2009-12-16",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Avatar",
    "poster_url":"assets/avatar.png",
    "short_story": "Avatar begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 15,
    "name": "Avatar: The Way of Water",
    "genre": "Action",
    "rating": 7.8,
    "review": "'Avatar: The Way of Water' is set more than a decade after the events of the first film. It follows Jake Sully (Sam Worthington) and Neytiri (Zoe Saldaña) as they navigate new challenges while raising their family on the extrasolar moon Pandora. The film introduces the aquatic Metkayina clan and showcases stunning underwater visuals and new Na'vi cultures. ",
    "reviewer_name": "System",
    "review_date": "2022-05-14",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Avatar: The Way of Water",
    "poster_url": "assets/way.png",
    "short_story": "Avatar: The Way of Water begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 16,
    "name": "Joker",
    "genre": "Drama",
    "rating": 8.4,
    "review": "Joker is regarded as a dark, thought-provoking, and highly immersive character study. It’s recommended for viewers interested in psychological thrillers, explorations of comic book villains in realistic contexts, and standout acting performances. While intense and disturbing, its cinematic quality and Phoenix’s portrayal make it a must-watch for adult audiences",
    "reviewer_name": "System",
    "review_date": "2019-08-24",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Joker",
    "poster_url": "assets/joker.png",
    "short_story": "Joker begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 17,
    "name": "Deadpool",
    "genre": "Comedy",
    "rating": 8.0,
    "review": "'Deadpool' follows Wade Wilson, a former special forces operative turned mercenary, who undergoes a rogue experiment that leaves him immortal but hideously scarred. Seeking revenge on the man who ruined his life, Wade adopts the alter ego Deadpool, known for his sharp wit, fourth-wall breaking humor, and highly unorthodox approach to heroism. The film blends intense action sequences, comedic dialogue, and a romantic subplot with Vanessa, Wades love interest, creating a story that is both action-packed and self-aware.",
    "reviewer_name": "System",
    "review_date": "2019-03-23",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Deadpool",
    "poster_url": "assets/deadpool.png",
    "short_story": "Deadpool begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 18,
    "name": "Iron Man",
    "genre": "Action",
    "rating": 7.9,
    "review": "Billionaire industrialist and engineering genius Tony Stark is captured by the terrorist group, the Ten Rings, in Afghanistan while showcasing weapons for his company, Stark Industries. Gravely injured by a missile, Stark is saved by fellow captive Ho Yinsen, who implants an electromagnet in his chest to prevent shrapnel from killing him. Under duress, Stark constructs a crude armored suit powered by a miniaturized arc reactor, which allows him to escape captivity. Returning to the U.S., Stark refines the suit with advanced technology and decides to cease weapons manufacturing, clashing with his business partner Obadiah Stane, who secretly turns villainous and creates a rival suit. Stark ultimately defeats Stane using his upgraded armor and publicly reveals his identity as Iron Man, setting the stage for the Avengers Initiative.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Iron Man",
    "poster_url": "assets/ironman.png",
    "short_story": "Iron Man begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 19,
    "name": "Captain America: Civil War",
    "genre": "Action",
    "rating": 7.8,
    "review": "'Captain America: Civil War' explores themes of loyalty, freedom vs. regulation, responsibility, and vengeance, blending superhero spectacle with morally complex dilemmas. The Russo brothers maintain a grounded, realistic aesthetic, combining high-octane action sequences with character-driven moments. Key standout elements include:",
    "reviewer_name": "System",
    "review_date": "2016-02-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Captain America: Civil War",
    "poster_url": "assets/civilwar.png",
    "short_story": "Captain America: Civil War begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 20,
    "name": "Black Panther",
    "genre": "Romance",
    "rating": 7.3,
    "review": "Black Panther is praised for creating a fully realized, unapologetically Black universe, with stunning cinematography (Rachel Morrison) and authentic costume design inspired by African cultures (Ruth E. Carter) . The film features strong female characters—Okoye, Nakia, and Shuri—who play pivotal roles in action and strategy . Its use of the Xhosa language for the Wakandan dialogue adds cultural authenticity . The movie became a landmark for representation and diversity in Hollywood.",
    "reviewer_name": "System",
    "review_date": "2018-12-08",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Black Panther",
    "poster_url": "assets/blackpanther.png",
    "short_story": "Black Panther begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 21,
    "name": "Spider-Man: No Way Home",
    "genre": "Romance",
    "rating": 8.5,
    "review": "Spider-Man: No Way Home is the third film in the MCU's Spider-Man series, following Homecoming (2017) and Far From Home (2019). The story begins immediately after Mysterio exposes Peter Parker's identity as Spider-Man to the world. Struggling with the consequences on his friends and his own safety, Peter enlists Doctor Strange to perform a memory spell that goes wrong, inadvertently opening the multiverse and bringing in villains from past Spider-Man films, including Doctor Octopus, Green Goblin, Electro, Sandman, and Lizard.",
    "reviewer_name": "System",
    "review_date": "2019-04-15",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Spider-Man: No Way Home",
    "poster_url": "assets/spidyno.png",
    "short_story": "Spider-Man: No Way Home begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 22,
    "name": "Frozen",
    "genre": "Drama",
    "rating": 8.3,
    "review": "'Frozen' is directed by Chris Buck and Jennifer Lee, with a screenplay by Lee, inspired by Hans Christian Andersen's fairy tale The Snow Queen. The story revolves around two sisters in the kingdom of Arendelle: Elsa, who has magical powers to create ice and snow, and Anna, her fearless younger sister. After Elsa accidentally plunges their kingdom into an eternal winter, Anna embarks on a perilous journey with ice harvester Kristoff, his reindeer Sven, and a comic snowman Olaf, to find Elsa and restore the kingdom.",
    "reviewer_name": "System",
    "review_date": "2013-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Frozen",
    "poster_url": "assets/frozen.png",
    "short_story": "Frozen begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 23,
    "name": "The Lion King",
    "genre": "Horror",
    "rating": 8.4,
    "review": "'The Lion King' is a coming-of-age musical drama set in the African savanna. The story follows Simba, the young lion cub son of King Mufasa, who is exiled after the murder of his father by his jealous uncle Scar. During his exile, Simba grows up under the care of his new friends, Timon and Pumbaa, adopting their carefree philosophy, 'Hakuna Matata.' As an adult, he is confronted by his past and encouraged by friends and the spirit of Mufasa to reclaim his rightful place as king and restore the Pride Lands.",
    "reviewer_name": "System",
    "review_date": "2000-06-28",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Lion King",
    "poster_url": "assets/lionking.png",
    "short_story": "The Lion King begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 24,
    "name": "Finding Nemo",
    "genre": "Action",
    "rating": 8.1,
    "review": "Finding Nemo follows Marlin, an overprotective clownfish, whose only surviving son, Nemo, is captured by scuba divers and taken to a dentist's office in Sydney. Determined to rescue him, Marlin embarks on a perilous ocean journey, accompanied by Dory, a forgetful blue tang. Along the way, they encounter a host of marine creatures, including friendly sea turtles, sharks who are part of 'Fish-Eaters Anonymous,' and jellyfish communities, facing various challenges as they navigate the vast ocean. Meanwhile, Nemo plans his escape from the dentist’s aquarium with the help of the, a scarred Moorish idol with a desire for freedom. Ultimately, Marlin and Nemo are reunited, having learned lessons about bravery, trust, and independence.",
    "reviewer_name": "System",
    "review_date": "2003-09-17",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Finding Nemo",
    "poster_url": "assets/findnemo.png",
    "short_story": "Finding Nemo begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 25,
    "name": "Toy Story",
    "genre": "Comedy",
    "rating": 8.3,
    "review": "Toy Story follows the story of Andy Davis, a young boy whose toys come to life when humans are not present. The plot focuses on Woody, Andy’s favorite pull-string cowboy doll, who becomes jealous when a modern spaceman action figure, Buzz Lightyear, arrives and quickly becomes Andy's new favorite . Initially rivals, Woody and Buzz embark on a thrilling adventure after being accidentally separated from Andy, encountering the mischievous neighbor Sid Phillips and his destructive dog Scud. Over the course of their journey, Woody and Buzz confront personal insecurities, learn to cooperate, and ultimately discover the true meaning of friendship and loyalty.",
    "reviewer_name": "System",
    "review_date": "2010-05-19",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Toy Story",
    "poster_url": "assets/toystory.png",
    "short_story": "Toy Story begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 26,
    "name": "Jurassic Park",
    "genre": "Action",
    "rating": 8.6,
    "review": "The Jurassic Park series, created by Michael Crichton and adapted into films by Steven Spielberg and others, centers on a theme park of cloned dinosaurs. The franchise explores the consequences of humans manipulating genetics, often resulting in chaos and dinosaur rampages. The films take place primarily on the fictional islands Isla Nublar and Isla Sorna near Costa Rica, eventually expanding to global settings in later installments like Jurassic World Dominion and Jurassic World Rebirth.",
    "reviewer_name": "System",
    "review_date": "2022-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Jurassic Park",
    "poster_url": "assets/jurassic.png",
    "short_story": "Jurassic Park begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 27,
    "name": "LOTR: Fellowship",
    "genre": "Drama",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "LOTR: Fellowship",
    "poster_url": "assets/fellowship.png",
    "short_story": "LOTR: Fellowship begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 28,
    "name": "LOTR: Two Towers",
    "genre": "Action",
    "rating": 8.5,
    "review": "The Fellowship of the Ring is the first novel of Tolkien’s epic The Lord of the Rings trilogy, set in the intricate world of Middle-earth, 60 years after the events of The Hobbit. The story follows Frodo Baggins, a hobbit who inherits the One Ring, an artifact of immense evil crafted by the Dark Lord Sauron to dominate all life. Gandalf, a wise wizard, warns Frodo of the Ring’s corrupting power and urges him to leave the Shire to bring it safely to Rivendell, the Elven stronghold .",
    "reviewer_name": "System",
    "review_date": "2000-10-29",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "LOTR: Two Towers",
    "poster_url": "assets/kingsreturn.png",
    "short_story": "LOTR: Two Towers begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 29,
    "name": "LOTR: Return of the King",
    "genre": "Romance",
    "rating": 8.8,
    "review": "The Return of the King is based on J.R.R. Tolkien’s novel of the same name. It is the third installment in the Lord of the Rings film trilogy, following The Two Towers (2002). The story continues the epic journey of Frodo Baggins (Elijah Wood) and Samwise Gamgee (Sean Astin) as they approach Mount Doom to destroy the One Ring, with Gollum (Andy Serkis) acting as a treacherous guide. Meanwhile, Aragorn (Viggo Mortensen), Gandalf (Ian McKellen), Legolas (Orlando Bloom), Gimli (John Rhys-Davies), and the allies of Gondor and Rohan mobilize to confront Sauron’s armies, culminating in the monumental battles at Minas Tirith and the Pelennor Fields .",
    "reviewer_name": "System",
    "review_date": "2002-09-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "LOTR: Return of the King",
    "poster_url": "assets/kingsreturn.png",
    "short_story": "LOTR: Return of the King begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 30,
    "name": "HP: Sorcerer 2019s Stone",
    "genre": "Action",
    "rating": 8.3,
    "review": "The story follows Harry Potter, an orphaned boy living with his cruel aunt and uncle. On his eleventh birthday, he learns he is a wizard and is invited to attend Hogwarts School of Witchcraft and Wizardry. There, he discovers the truth about his family's mysterious past and confronts the lingering influence of the dark wizard Lord Voldemort who murdered his parents but is still a threat to the magical world. Harry makes new friends, including Ron Weasley and Hermione Granger, and experiences adventures that test bravery, friendship, and loyalty.",
    "reviewer_name": "System",
    "review_date": "1997-05-05",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "HP: Sorcerer’s Stone",
    "poster_url": "assets/hpsorcer.png",
    "short_story": "HP: Sorcerer’s Stone begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 31,
    "name": "HP: Chamber of Secrets",
    "genre": "Horror",
    "rating": 8.9,
    "review": "Harry Potter's second year at Hogwarts School of Witchcraft and Wizardry. A series of mysterious messages declare that the Chamber of Secrets has been opened, and students who are Muggle-born are being attacked and petrified. Harry, alongside friends Ron and Hermione, investigates the attacks and uncovers a plot orchestrated by Tom Riddle, the young version of Lord Voldemort, who controls a deadly Basilisk within the Chamber. Key elements include Harry's ability to speak Parseltongue, encounters with the ghost Moaning Myrtle, and the eventual rescue of Ginny Weasley using the Sword of Gryffindor and Dumbledore’s phoenix Fawkes.",
    "reviewer_name": "System",
    "review_date": "1998-03-11",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "HP: Chamber of Secrets",
    "poster_url": "assets/hp2.png",
    "short_story": "HP: Chamber of Secrets begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 32,
    "name": "HP: Prisoner of Azkaban",
    "genre": "Horror",
    "rating": 8.0,
    "review": "'Harry Potter and the Prisoner of Azkaban,' the third installment in J.K. Rowling’s Harry Potter series, follows Harry during his third year at Hogwarts School of Witchcraft and Wizardry. The story begins with Harry accidentally inflating his Aunt Marge and fleeing the Dursleys’ home. The wizarding world is on edge as Sirius Black, an escaped prisoner from Azkaban convicted of betraying Harry's parents, is thought to be hunting him.",
    "reviewer_name": "System",
    "review_date": "2004-09-21",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "HP: Prisoner of Azkaban",
    "poster_url": "assets/hp3.png",
    "short_story": "HP: Prisoner of Azkaban begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 33,
    "name": "Star Wars: A New Hope",
    "genre": "Comedy",
    "rating": 7.9,
    "review": "Set in a galaxy ruled by the tyrannical Galactic Empire, the film follows the Rebel Alliance, which struggles to resist the Empire's power. The story begins when Princess Leia Organa obtains secret plans to the Empire's superweapon, the Death Star, but is captured by Darth Vader. The droids R2-D2 and C-3PO escape and deliver Leia's message to the reclusive Jedi Master Obi-Wan Kenobi. Luke Skywalker, a young farmer dreaming of adventure, joins Obi-Wan in a mission to rescue Leia. Along the way, they enlist smuggler Han Solo and his co-pilot Chewbacca. The climactic battle on the Death Star sees Luke using the mystical Force to destroy the station, ensuring a vital victory for the Rebels.",
    "reviewer_name": "System",
    "review_date": "1977-10-21",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Star Wars: A New Hope",
    "poster_url": "assets/newep.png",
    "short_story": "Star Wars: A New Hope begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 34,
    "name": "Star Wars: Empire Strikes Back",
    "genre": "Comedy",
    "rating": 8.0,
    "review": "The Empire Strikes Back, directed by Irvin Kershner and written by Leigh Brackett and Lawrence Kasdan from a story by George Lucas, is the second film in the original Star Wars trilogy and the fifth chronological chapter of the Skywalker Saga. The film is set three years after A New Hope and follows the Galactic Empire's retaliation against the Rebel Alliance. Luke Skywalker travels to the swamp planet Dagobah to train as a Jedi under Master Yoda, while Han Solo, Princess Leia, Chewbacca, and C-3PO evade Darth Vader and bounty hunters across the galaxy. Key plot developments include the Imperial assault on Hoth, Luke’s Jedi training, and the revelation that Darth Vader is Luke’s father . The ensemble cast includes Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, and Frank Oz as Yoda.",
    "reviewer_name": "System",
    "review_date": "1980-09-23",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Star Wars: Empire Strikes Back",
    "poster_url": "assets/strikes.png",
    "short_story": "Star Wars: Empire Strikes Back begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 35,
    "name": "Star Wars: Return of the Jedi",
    "genre": "Action",
    "rating": 8.0,
    "review": "Return of the Jedi is a 1983 American epic space opera directed by Richard Marquand, with a screenplay by Lawrence Kasdan and George Lucas, based on Lucas's story. It is the sixth chronological film in the Star Wars “Skywalker Saga” and the third installment of the original trilogy. The film concludes the narrative arc of Luke Skywalker, Leia Organa, Han Solo, and the struggle of the Rebel Alliance against the oppressive Galactic Empire.",
    "reviewer_name": "System",
    "review_date": "1983-04-28",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Star Wars: Return of the Jedi",
    "poster_url": "assets/jedireturn.png",
    "short_story": "Star Wars: Return of the Jedi begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 36,
    "name": "The Social Network",
    "genre": "Drama",
    "rating": 9.6,
    "review": "The film portrays the story of Harvard student Mark Zuckerberg (Jesse Eisenberg) and the creation of Facebook, detailing personal relationships, betrayals, and legal disputes with co-founder Eduardo Saverin (Andrew Garfield) and the Winklevoss twins (Armie Hammer) . The narrative employs dual depositions as framing devices, interspersed with flashbacks showcasing ambition, friendship, rivalry, and the complexities behind building one of the world’s most influential social networks .",
    "reviewer_name": "System",
    "review_date": "2002-12-29",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Social Network",
    "poster_url": "assets/social.png",
    "short_story": "The Social Network begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 37,
    "name": "Whiplash",
    "genre": "Romance",
    "rating": 8.0,
    "review": "'Whiplash' follows Andrew Neiman, a driven 19-year-old jazz drummer attending the prestigious Shaffer Conservatory in New York City. He dreams of brilliance like his idol Buddy Rich. Andrew’s life becomes consumed by his ruthless instructor Terence Fletcher, who pushes students to extremes through intimidation, verbal abuse, and psychological manipulation. The film chronicles Andrew’s relentless pursuit of perfection, the sacrifices in his personal life and relationships, and the psychological and physical toll of Fletcher’s mentorship.",
    "reviewer_name": "System",
    "review_date": "2019-06-29",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Whiplash",
    "poster_url": "assets/whiplash.png",
    "short_story": "Whiplash begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 38,
    "name": "La La Land",
    "genre": "Romance",
    "rating": 8.0,
    "review": "La La Land, directed and written by Damien Chazelle, stars Ryan Gosling as Sebastian, a jazz pianist, and Emma Stone as Mia, an aspiring actress. The film tells the story of two young artists pursuing their dreams in Los Angeles while navigating their tumultuous romantic relationship. Set against the glittering, dreamlike backdrop of L.A., the movie explores themes of ambition, love, sacrifice, and the tension between personal aspirations and relationships. Its title, “La La Land,” reflects both the city’s magical yet illusory allure and the euphoric, sometimes surreal world of pursuing dreams.",
    "reviewer_name": "System",
    "review_date": "2016-11-14",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "La La Land",
    "poster_url": "assets/lala.png",
    "short_story": "La La Land begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 39,
    "name": "The Wolf of Wall Street",
    "genre": "Action",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Wolf of Wall Street",
    "poster_url": "sample.jpg",
    "short_story": "The Wolf of Wall Street begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 40,
    "name": "Oppenheimer",
    "genre": "Drama",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Oppenheimer",
    "poster_url": "sample.jpg",
    "short_story": "Oppenheimer begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 41,
    "name": "Barbie",
    "genre": "Romance",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Barbie",
    "poster_url": "sample.jpg",
    "short_story": "Barbie begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 42,
    "name": "Dune",
    "genre": "Drama",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Dune",
    "poster_url": "sample.jpg",
    "short_story": "Dune begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 43,
    "name": "Dune: Part Two",
    "genre": "Comedy",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Dune: Part Two",
    "poster_url": "sample.jpg",
    "short_story": "Dune: Part Two begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 44,
    "name": "John Wick",
    "genre": "Comedy",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "John Wick",
    "poster_url": "sample.jpg",
    "short_story": "John Wick begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 45,
    "name": "John Wick: Chapter 4",
    "genre": "Action",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "John Wick: Chapter 4",
    "poster_url": "sample.jpg",
    "short_story": "John Wick: Chapter 4 begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 46,
    "name": "The Conjuring",
    "genre": "Horror",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Conjuring",
    "poster_url": "sample.jpg",
    "short_story": "The Conjuring begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 47,
    "name": "It",
    "genre": "Horror",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "It",
    "poster_url": "sample.jpg",
    "short_story": "It begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 48,
    "name": "Hereditary",
    "genre": "Horror",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "Hereditary",
    "poster_url": "sample.jpg",
    "short_story": "Hereditary begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  },
  {
    "id": 49,
    "name": "The Exorcist",
    "genre": "Horror",
    "rating": 8.0,
    "review": "Generated review.",
    "reviewer_name": "System",
    "review_date": "2024-03-01",
    "spoiler_alert": false,
    "recommendation": "Yes",
    "movie_title": "The Exorcist",
    "poster_url": "sample.jpg",
    "short_story": "The Exorcist begins with an unexpected turn of fate that sets the tone for its world. As the characters rise and fall, their relationships shape the journey. Moments of conflict reveal deeper truths hidden beneath the surface. A turning point emerges, challenging everything the characters believe. The tension builds toward a powerful and emotional climax. In the end, the story leaves a lasting impression long after it concludes."
  }
]